In [176]:
import numpy as np

In [178]:
import pandas as pd

In [180]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler,OneHotEncoder
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score,classification_report
df=pd.read_csv('customer_churn.csv')
df.head

<bound method NDFrame.head of                 Names  Age  Monthly_charges  Account_Manager  Tanure  \
0    Cameron Williams   42         11066.80                0    7.22
1       Kevin Mueller   41         11916.22                0    6.50
2         Eric Lozano   38         12884.75                0    6.67
3       Phillip White   42          8010.76                0    6.71
4      Cynthia Norton   37          9191.58                0    5.56
..                ...  ...              ...              ...     ...
895       Paul Miller   42         12800.82                1    3.62
896    Natalie Hodges   52          9893.92                0    6.91
897         Ana Smith   45         12056.18                0    5.46
898    Justin Leonard   51          6517.93                1    5.47
899   Joseph Williams   39          9315.60                1    5.02

     Num_Sites              date  \
0            8    8/30/2013 7:00
1           11    8/13/2013 0:38
2           12    6/29/2016 6:20
3           10   4/22/2014 12:43
4            9   1/19/2016 15:31
..         ...               ...
895          8   12/1/2007 13:29
896          7  12/28/2008 15:23
897          4    6/20/2014 5:10
898         10    5/30/2012 0:15
899         10   9/25/2010 12:16

                                              Location  \
0        10265 Elizabeth Mission Barkerburgh, AK 89518
1    6157 Frank Gardens Suite 019 Carloshaven, RI 1...
2               1331 Keith Court Alyssahaven, DE 90114
3         13120 Daniel Mount Angelabury, WY 30645-4695
4                  765 Tricia Row Karenshire, MH 71730
..                                                 ...
895  9316 Julian Fort Suite 328 North Leslie, ME 43961
896  8419 William Square Apt. 695 Martinville, RI 3...
897               Unit 8633 Box 8738 DPO AA 14126-5026
898  49800 Torres Ways Suite 886 West Bradleybury, ...
899       27252 Olivia Burgs Rivasmouth, MN 80121-6348

                         Company  Churn
0                     Harvey LLC      1
1                     Wilson PLC      1
2    Miller, Johnson and Wallace      1
3                      Smith Inc      1
4                     Love-Jones      1
..                           ...    ...
895                 Evans-Lucero      0
896               Perry and Sons      0
897              Schneider-Smith      0
898                Robles-Abbott      0
899                  Davis Group      0

[900 rows x 10 columns]>

In [182]:
df.drop(["Names","Company"],axis=1)

,Age,Monthly_charges,Account_Manager,Tanure,Num_Sites,date,Location,Churn
0,42,11066.80,0,7.22,8,8/30/2013 7:00,"10265 Elizabeth Mission Barkerburgh, AK 89518",1
1,41,11916.22,0,6.50,11,8/13/2013 0:38,"6157 Frank Gardens Suite 019 Carloshaven, RI 1...",1
2,38,12884.75,0,6.67,12,6/29/2016 6:20,"1331 Keith Court Alyssahaven, DE 90114",1
3,42,8010.76,0,6.71,10,4/22/2014 12:43,"13120 Daniel Mount Angelabury, WY 30645-4695",1
4,37,9191.58,0,5.56,9,1/19/2016 15:31,"765 Tricia Row Karenshire, MH 71730",1
...,...,...,...,...,...,...,...,...
895,42,12800.82,1,3.62,8,12/1/2007 13:29,"9316 Julian Fort Suite 328 North Leslie, ME 43961",0
896,52,9893.92,0,6.91,7,12/28/2008 15:23,"8419 William Square Apt. 695 Martinville, RI 3...",0
897,45,12056.18,0,5.46,4,6/20/2014 5:10,Unit 8633 Box 8738 DPO AA 14126-5026,0
898,51,6517.93,1,5.47,10,5/30/2012 0:15,"49800 Torres Ways Suite 886 West Bradleybury, ...",0
899,39,9315.60,1,5.02,10,9/25/2010 12:16,"27252 Olivia Burgs Rivasmouth, MN 80121-6348",0

In [184]:
print(df["date"].head())
print(df.dtypes)
df["date"] = pd.to_datetime(df["date"], errors="coerce") 
df["date_year"] = df["date"].dt.year
df = df.drop(columns=["date"])

0     8/30/2013 7:00
1     8/13/2013 0:38
2     6/29/2016 6:20
3    4/22/2014 12:43
4    1/19/2016 15:31
Name: date, dtype: object
Names               object
Age                  int64
Monthly_charges    float64
Account_Manager      int64
Tanure             float64
Num_Sites            int64
date                object
Location            object
Company             object
Churn                int64
dtype: object

In [186]:
df=pd.get_dummies(df,columns=["Location"],drop_first=True)

In [188]:
print(df.isnull().sum())
df=df.dropna()
x=df.drop("Churn",axis=1)
y=df["Churn"]

Names                                            0
Age                                              0
Monthly_charges                                  0
Account_Manager                                  0
Tanure                                           0
                                                ..
Location_Unit 8633 Box 8738 DPO AA 14126-5026    0
Location_Unit 8716 Box 6865 DPO AE 33780         0
Location_Unit 9127 Box 5819 DPO AE 24161         0
Location_Unit 9630 Box 8710 DPO AP 69319         0
Location_Unit 9800 Box 2878 DPO AA 75157         0
Length: 908, dtype: int64

In [190]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,random_state=42)

In [210]:


x = x.replace({"NA/": np.nan, "unknown": np.nan})

# Convert all columns to numeric, coercing errors to NaN
x = x.apply(pd.to_numeric, errors="coerce")

# Drop rows with NaN values after conversion
print("Dataset shape before dropping NaNs:", x.shape)
x = x.dropna()
print("Dataset shape after dropping NaNs:", x.shape)

# Check if dataset is empty
if x.empty:
    raise ValueError("Error: The dataset is empty after preprocessing. Check the data cleaning steps!")

# Dynamically adjust test_size if dataset is very small
test_size = 0.5 if len(x) < 5 else 0.2

# Split dataset
x_train, x_test = train_test_split(x, test_size=test_size, random_state=42)

# Initialize and apply StandardScaler
scaler = StandardScaler()
x_train = scaler.fit_transform(x_train)
x_test = scaler.transform(x_test)

Dataset shape before dropping NaNs: (0, 8)
Dataset shape after dropping NaNs: (0, 8)

ValueError: Error: The dataset is empty after preprocessing. Check the data cleaning steps!